Revit 2027 API
BuiltInFailures.MirrorFailures Class
 Failures about Mirror.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MirrorFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MirrorFailures
Public NotInheritable Class MirrorFailures
public ref class MirrorFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MirrorFailures = class end
The BuiltInFailures.MirrorFailures type exposes the following members.
Properties
Name | Description
BadMirror |  Can't mirror element into this position.
Top
See Also
Reference
Autodesk.Revit.DB Namespace